# Parameters
nc: 8  # number of classes
scales:
#depth_multiple: 1.0  # model depth multiple
#width_multiple: 1.0  # layer channel multiple
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, PatchEmbed_FasterNet, [40, 4, 4]]  #0 0-P1/4 第0层的输入是640*640*3的图像。Embedding层是Conv卷积层。40代表输出通道数，4代表卷积核大小k，后面的4代表步长。输出的特征图为160*160*40
  - [-1, 1, BasicStage, [40, 1]]  # 1 40代表输出通道数，1代表池化核大小，特征图尺寸不变。输出的特征图为160*160*40
  - [-1, 1, PatchMerging_FasterNet, [80, 2, 2]]  #2 2-P2/8 80代表输出通道数，2代表池化核大小，后面的2代表步长。输出的特征图80*80*80
  - [-1, 2, BasicStage, [80, 1]]  #3 3-P3/16 80代表输出通道数，1代表池化核大小，特征图尺寸不变。输出的特征图为80*80*80
  - [-1, 1, PatchMerging_FasterNet, [160, 2, 2]]  #4 4 160代表输出通道数，2代表池化核大小，后面的2代表步长。输出的特征图40*40*160
  - [-1, 8, BasicStage, [160, 1]]  #5 5-P4/32 160代表输出通道数，1代表池化核大小，特征图尺寸不变。输出的特征图为40*40*160
  - [-1, 1, PatchMerging_FasterNet, [320, 2, 2]] # 6 320代表输出通道数，2代表池化核大小，后面的2代表步长。输出的特征图20*20*320
  - [-1, 2, BasicStage, [320, 1]] # 7 320代表输出通道数，1代表池化核大小，特征图尺寸不变。输出的特征图为20*20*3320.20
  - [-1, 1, SPPF, [320, 5]]  # 8 320代表输出通道数，5代表池化核大小，特征图尺寸不变。输出的特征图为20*20*320


# YOLOv8.0n head
head:
  - [-1, 1, CARAFE, [512, 3, 2]] #9 本层是上采样层，-1代表将上层的输出作为本层的输入。512代表输出通道数，3代表池化核大小，2代表上采样率，因此输出的尺寸是输入的2倍。输出的特征图40*40*512
  - [[-1, 5], 1, Concat, [1]]  #10 cat backbone P4 【-1，5】代表将上层和第5层的输出作为本层的输入，1代表拼接的维度为1，上层输出为40*40*512，第5层输出为40*40*160，因此本层的输出为 40*40*672
  - [-1, 1, C2f_MLCA, [512]]  # 11 512代表输出通道数， 输出的特征图为40*40*512

  - [-1, 1, CARAFE, [256, 3, 2]] #12  本层是上采样层，-1代表将上层的输出作为本层的输入。256代表输出通道数，3代表池化核大小，2代表上采样率，因此输出的尺寸是输入的2倍。输出的特征图80*80*256
  - [[-1, 3], 1, Concat, [1]]  #13 cat backbone P3 【-1，3】代表将上层和第3层的输出作为本层的输入，1代表拼接的维度为1，上层输出为80*80*256，第3层输出为80*80*80，因此本层的输出为 80*80*336
  - [-1, 1, C2f_MLCA, [256]]  # 14 (P3/8-small) 256代表输出通道数， 输出的特征图为80*80*256

  - [-1, 1, Conv, [256, 3, 2]] #15 卷积操作，256代表输出通道数，3代表卷积核大小，2代表步长。输出的特征图为40*40*256
  - [[-1, 11], 1, Concat, [1]]  #16 cat head P4 【-1，11】代表将上层和第11层的输出作为本层的输入，1代表拼接的维度为1，上层输出为40*40*256，第11层输出为40*40*512，因此本层的输出为 40*40*768
  - [-1, 1, C2f_MLCA, [512]]  # 17 (P4/16-medium) 512代表输出通道数， 输出的特征图为40*40*512

  - [-1, 1, Conv, [512, 3, 2]] # 18 卷积操作，512代表输出通道数，3代表卷积核大小，2代表步长。输出的特征图为20*20*512
  - [[-1, 8], 1, Concat, [1]]  #19 cat head P5 【-1，8】代表将上层和第8层的输出作为本层的输入，1代表拼接的维度为1，上层输出为20*20*512，第8层输出为20*20*320，因此本层的输出为 20*20*832
  - [-1, 1, C2f_MLCA, [1024]]  # 20 (P5/32-large) 1024代表输出通道数， 输出的特征图为20*20*1024

  - [[14, 17, 20], 1, Detect, [nc]]  #21 Detect(P3, P4, P5) 【14 17 20】代表将第14、17、20的输出作为本层的输入，1代表拼接的维度为1，14层输出为80*80*256，第17层输出为40*40*512，第20层为20*20*1024
